public class FunctionCallIsExpression {
}
//Выражение — это код, который при выполнении программы превращается в значение.
//// простые вызовы
//var result = Math.min(1, 5);       // 1
//
//// выражения в аргументах
//var result = Math.min(1, 2 + 3);   // 1
//
//// выражения с переменными в аргументах
//var number = 2 + 2;
//var result = Math.min(1, 1 + number);  // 1

//Если какая-то функция осуществляет вычисление чего-то и при этом выводит какие-то данные на экран, то с точки зрения вычисления результата вывод на экран - побочный эффект.